Tekla Open API Reference for Tekla Structures 2025
Operation.Split Method (LoftedPlate, Point)
 Splits the lofted plate and creates a new one in the given position.
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static LoftedPlate Split(
	LoftedPlate Object,
	Point SplitPoint
)
Public Shared Function Split (
	Object As LoftedPlate,
	SplitPoint As Point
) As LoftedPlate
Parameters
Object
Type: Tekla.Structures.Model.LoftedPlate
The lofted plate to be split.
SplitPoint
Type: Tekla.Structures.Geometry3d.Point
The position where splitting is executed.
Return Value
Type: LoftedPlate
The created lofted plate on success, null on failure.
See Also
Reference
Operation Class
Split Overload
Tekla.Structures.Model.Operations Namespace